-*- Mode: org; mode: auto-fill; fill-column: 76 -*-

#+SEQ_TODO: TODO(t) STARTED(s!) SOMEDAY(S!) WAIT(w@/!) DELEGATE(e@/!) | DONE(d!/!)  CANCELED(c@)
#+STARTUP: overview
#+STARTUP: lognotestate
#+TAGS: noexport(n) export(e)
#+PROPERTY: Effort_ALL 0 0:10 0:20 0:30 1:00 2:00 4:00 6:00 8:00

#+TITLE:     Property Inspection Prediction
#+AUTHOR:    Leandro Fernandes
#+DATE:      <2015-07-09 Thu>

#+LANGUAGE:  en
#+TEXT:      GTD Agenda
#+OPTIONS:   H:3 num:t toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t TeX:t LaTeX:nil skip:t d:nil tags:not-in-toc
#+INFOJS_OPT: view:overview toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+LINK_UP:
#+LINK_HOME:
#+PROPERTY: Effort_ALL 0:05 0:15 0:30 0:45 1:00 1:30 2:00 3:00 4:00 5:00
#+TAGS: DATA(d) MODELLING(m) FORECASTING(f) WRITTING(w) REFACTORING(r)
#+COLUMNS: %40ITEM(Task) %TODO %17Effort(Estimated Effort){:} %CLOCKSUM %TAGS

# Local Variables:
# org-export-html-style: "   <style type=\"text/css\">
#    a:link, a:visited {font-style: italic; text-decoration: none; color: black; }
#    a:active {font-style: italic; texit-decoration: none; color: blue; } </style>
#   </style>"
# End:

#+BABEL: :exports code

#+DESCRIPTION:
#+EXCLUDE_TAGS: noexport
#+KEYWORDS:
#+LANGUAGE: en
#+SELECT_TAGS: export

** Managing instance

   * Listing instance

     #+BEGIN_SRC sh :session *Deploy* :results output
       aws ec2 describe-images --owners --filters "Name=name,Values=*anaconda*" --output text
     #+END_SRC

   * Stop

     #+BEGIN_SRC sh :session *Deploy* :results output
       aws ec2 stop-instances --instance-ids $INSTANCE_ID
     #+END_SRC

   * Start

      #+BEGIN_SRC sh :session *Deploy* :results output
       aws ec2 start-instances --instance-ids $INSTANCE_ID
     #+END_SRC

   * Terminate

     #+BEGIN_SRC sh :session *Deploy* :results output
       aws ec2 terminate-instances --instance-ids $INSTANCE_ID
     #+END_SRC

     #+RESULTS:
     #+begin_example
	 {
	     "TerminatingInstances": [
		 {
		     "InstanceId": "i-045347c4", 
		     "CurrentState": {
			 "Code": 32, 
			 "Name": "shutting-down"
		     }, 
		     "PreviousState": {
			 "Code": 16, 
			 "Name": "running"
		     }
		 }
	     ]
	 }
     #+end_example

